EXISTING_MENUS = [
    [
        "レギュラーバンズ(蒸し)",
        "グラコロ(デミグラス)",
        "レギュラーバンズ(蒸し)",
    ],  # グラコロ
    [
        "サムライマックバンズ",
        "タマネギ(サムライマック)",
        "チーズ",
        "ビーフ(サムライマック)",
        "チーズ",
        "ビーフ(サムライマック)",
        "サムライマックバンズ",
    ],  # 炙り醤油風 ダブル肉厚ビーフ
    [
        "サムライマックバンズ",
        "タマネギ(サムライマック)",
        "トマト(サムライマック)",
        "レタス(サムライマック)",
        "ベーコン",
        "ビーフ(サムライマック)",
        "チーズ",
        "サムライマックバンズ",
    ],  # 炙り醤油風 ベーコントマト肉厚ビーフ
    [
        "ビッグマックバンズ",
        "ビーフ",
        "ピクルス",
        "レタス(ビックマック)",
        "ビッグマックバンズ(中間)",
        "ビーフ",
        "チーズ",
        "レタス(ビックマック)",
        "ビッグマックバンズ",
    ],  # ビッグマック
    [
        "レギュラーバンズ",
        "ピクルス",
        "チーズ",
        "ビーフ",
        "チーズ",
        "ビーフ",
        "レギュラーバンズ",
    ],  # ダブルチーズバーガー
    [
        "セサミバンズ",
        "レタス(てりやき)",
        "ポーク(てりやき)",
        "セサミバンズ",
    ],  # てりやきマックバーガー
    [
        "レギュラーバンズ(蒸し)",
        "フィッシュポーション(フィレオフィッシュ)",
        "チーズ",
        "レギュラーバンズ(蒸し)",
    ],  # フィレオフィッシュ,
    [
        "セサミバンズ",
        "レタス(チキンフィレオ)",
        "チキン(チキンフィレオ)",
        "セサミバンズ",
    ],  # チキンフィレオ,
    [
        "セサミバンズ",
        "レタス(てりやきチキンフィレオ)",
        "チキン(てりやきチキンフィレオ)",
        "セサミバンズ",
    ],  # てりやきチキンフィレオ
    [
        "セサミバンズ",
        "レタス(ベーコンレタスバーガー)",
        "チーズ",
        "ベーコン",
        "ビーフ",
        "セサミバンズ",
    ],  # ベーコンレタスバーガー
    [
        "セサミバンズ(蒸し)",
        "レタス(えびフィレオ)",
        "えび(えびフィレオ)",
        "セサミバンズ(蒸し)",
    ],  # えびフィレオ
    [
        "セサミバンズ",
        "レタス(マックチキン)",
        "チキン(マックチキン)",
        "セサミバンズ",
    ],  # マックチキン
    [
        "セサミバンズ",
        "レタス(スパチキ)",
        "チキン(スパチキ)",
        "セサミバンズ",
    ],  # スパチキ
    [
        "セサミバンズ",
        "レタス(チキチー)",
        "チキン(マックチキン)",
        "チーズ",
        "セサミバンズ",
    ],  # チキチー
    [
        "レギュラーバンズ",
        "ピクルス",
        "エッグ",
        "チーズ",
        "ビーフ",
        "レギュラーバンズ",
    ],  # エグチ
    ["レギュラーバンズ", "ピクルス", "ビーフ", "レギュラーバンズ"],  # ハンバーガー,
    [
        "レギュラーバンズ",
        "ピクルス",
        "チーズ",
        "ビーフ",
        "レギュラーバンズ",
    ],  # チーズバーガー,
    [
        "レギュラーバンズ(蒸し)",
        "グラコロ(デミグラス&タルタル)",
        "レギュラーバンズ(蒸し)",
    ],  # 濃厚デミ&タルタルグラコロ,
]
