PARTIES = {
    "ビーフ": (2.0, 170),
    "ビーフ(サムライマック)": (2.0, 570),
    "ポーク(てりやき)": (2.0, 400),
    "チキン(チキンフィレオ)": (2.0, 410),
    "チキン(てりやきチキンフィレオ)": (2.0, 420),
    "チキン(マックチキン)": (2.0, 180),
    "チキン(スパチキ)": (2.0, 200),
    "フィッシュポーション(フィレオフィッシュ)": (2.0, 400),
    "えび(えびフィレオ)": (2.0, 430),
    "グラコロ(デミグラス)": (2.0, 440),
    "グラコロ(デミグラス&タルタル)": (2.0, 490),
    "ベーコン": (1.5, 410),
}
VEGETABLES = {
    "ピクルス": (0.5, 170),
    "レタス(サムライマック)": (1.0, 570),
    "レタス(ビックマック)": (1.0, 480),
    "レタス(てりやき)": (1.0, 400),
    "レタス(チキンフィレオ)": (1.0, 410),
    "レタス(てりやきチキンフィレオ)": (1.0, 420),
    "レタス(ベーコンレタスバーガー)": (1.0, 410),
    "レタス(マックチキン)": (1.0, 180),
    "レタス(えびフィレオ)": (1.0, 430),
    "レタス(スパチキ)": (1.0, 200),
    "レタス(チキチー)": (1.0, 240),
    "タマネギ(サムライマック)": (1.0, 570),
    "トマト(サムライマック)": (1.0, 570),
}

# SAUCES = {
#     "デミグラスソース": 1.5,
# }

OTHERS = {
    "ビッグマックバンズ(中間)": (1.3, 480),
    "エッグ": (1.5, 240),
    "チーズ": (1.5, 200),
}

FILLINGS = PARTIES | VEGETABLES | OTHERS
